Tekla Open API Reference for Tekla Structures 2025
OBB.ShortestSegmentTo Method
Overload List
Name | Description
ShortestSegmentTo(Line)
 Calculates the shortest LineSegment from OBB to the given Line.
ShortestSegmentTo(LineSegment)
 Calculates the shortest LineSegment from OBB to the given LineSegment.
ShortestSegmentTo(Point)
 Calculates the shortest LineSegment from OBB to the given point.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace